BaMI805PGZcUxQ36.html

<h2 style="padding: 10px 0 10px 0; display: block; border-top: solid 2px #000000; border-bottom: solid 2px #000000;">
			[2014-07-31 03:08:50]</h2><h2>Function 'getCourierOrderAvailabilityV1' params
			</h2><pre>Array
(
    [0] => Array
        (
            [senderPlaceV1] => Array
                (
                    [countryCode] => PL
                    [zipCode] => 30732
                )

        )

)
</pre><h2>Request</h2><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:ns1=&quot;http://dpdservices.dpd.com.pl/&quot;&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;ns1:getCourierOrderAvailabilityV1&gt;
            &lt;senderPlaceV1&gt;
                &lt;countryCode&gt;PL&lt;/countryCode&gt;
                &lt;zipCode&gt;30732&lt;/zipCode&gt;
            &lt;/senderPlaceV1&gt;
            &lt;authDataV1&gt;
                &lt;login&gt;test&lt;/login&gt;
                &lt;masterFid&gt;256985&lt;/masterFid&gt;
                &lt;password&gt;KqvsoFLT2M&lt;/password&gt;
            &lt;/authDataV1&gt;
        &lt;/ns1:getCourierOrderAvailabilityV1&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
</pre><h2>Response</h2><pre>stdClass Object
(
    [ranges] => Array
        (
            [0] => stdClass Object
                (
                    [offset] => 120
                    [range] => 13:00-16:00
                )

            [1] => stdClass Object
                (
                    [offset] => 120
                    [range] => 14:00-17:00
                )

            [2] => stdClass Object
                (
                    [offset] => 120
                    [range] => 15:00-18:00
                )

            [3] => stdClass Object
                (
                )

        )

    [status] => OK
)
</pre><h2 style="padding: 10px 0 10px 0; display: block; border-top: solid 2px #000000; border-bottom: solid 2px #000000;">
			[2014-07-31 03:07:38]</h2><h2>Function 'getCourierOrderAvailabilityV1' params
			</h2><pre>Array
(
    [0] => Array
        (
            [senderPlaceV1] => Array
                (
                    [countryCode] => PL
                    [zipCode] => 30732
                )

        )

)
</pre><h2>Request</h2><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:ns1=&quot;http://dpdservices.dpd.com.pl/&quot;&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;ns1:getCourierOrderAvailabilityV1&gt;
            &lt;senderPlaceV1&gt;
                &lt;countryCode&gt;PL&lt;/countryCode&gt;
                &lt;zipCode&gt;30732&lt;/zipCode&gt;
            &lt;/senderPlaceV1&gt;
            &lt;authDataV1&gt;
                &lt;login&gt;test&lt;/login&gt;
                &lt;masterFid&gt;256985&lt;/masterFid&gt;
                &lt;password&gt;KqvsoFLT2M&lt;/password&gt;
            &lt;/authDataV1&gt;
        &lt;/ns1:getCourierOrderAvailabilityV1&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
</pre><h2>Errors</h2><pre>Array
(
)
</pre><h2 style="padding: 10px 0 10px 0; display: block; border-top: solid 2px #000000; border-bottom: solid 2px #000000;">
			[2014-07-31 03:05:11]</h2><h2>Function 'getCourierOrderAvailabilityV1' params
			</h2><pre>Array
(
    [0] => Array
        (
            [senderPlaceV1] => Array
                (
                    [countryCode] => PL
                    [zipCode] => 30732
                )

        )

)
</pre><h2>Request</h2><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:ns1=&quot;http://dpdservices.dpd.com.pl/&quot;&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;ns1:getCourierOrderAvailabilityV1&gt;
            &lt;senderPlaceV1&gt;
                &lt;countryCode&gt;PL&lt;/countryCode&gt;
                &lt;zipCode&gt;30732&lt;/zipCode&gt;
            &lt;/senderPlaceV1&gt;
            &lt;authDataV1&gt;
                &lt;login&gt;test&lt;/login&gt;
                &lt;masterFid&gt;256985&lt;/masterFid&gt;
                &lt;password&gt;KqvsoFLT2M&lt;/password&gt;
            &lt;/authDataV1&gt;
        &lt;/ns1:getCourierOrderAvailabilityV1&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
</pre><h2>Errors</h2><pre>Array
(
)
</pre><h2 style="padding: 10px 0 10px 0; display: block; border-top: solid 2px #000000; border-bottom: solid 2px #000000;">
			[2014-07-31 03:04:25]</h2><h2>Function 'getCourierOrderAvailabilityV1' params
			</h2><pre>Array
(
    [0] => Array
        (
            [senderPlaceV1] => Array
                (
                    [countryCode] => PL
                    [zipCode] => 30732
                )

        )

)
</pre><h2>Request</h2><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:ns1=&quot;http://dpdservices.dpd.com.pl/&quot;&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;ns1:getCourierOrderAvailabilityV1&gt;
            &lt;senderPlaceV1&gt;
                &lt;countryCode&gt;PL&lt;/countryCode&gt;
                &lt;zipCode&gt;30732&lt;/zipCode&gt;
            &lt;/senderPlaceV1&gt;
            &lt;authDataV1&gt;
                &lt;login&gt;test&lt;/login&gt;
                &lt;masterFid&gt;256985&lt;/masterFid&gt;
                &lt;password&gt;KqvsoFLT2M&lt;/password&gt;
            &lt;/authDataV1&gt;
        &lt;/ns1:getCourierOrderAvailabilityV1&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
</pre><h2>Response</h2><pre>stdClass Object
(
    [ranges] => Array
        (
            [0] => stdClass Object
                (
                    [offset] => 120
                    [range] => 13:00-16:00
                )

            [1] => stdClass Object
                (
                    [offset] => 120
                    [range] => 14:00-17:00
                )

            [2] => stdClass Object
                (
                    [offset] => 120
                    [range] => 15:00-18:00
                )

            [3] => stdClass Object
                (
                )

        )

    [status] => OK
)
</pre><h2 style="padding: 10px 0 10px 0; display: block; border-top: solid 2px #000000; border-bottom: solid 2px #000000;">
			[2014-07-31 03:02:29]</h2><h2>Function 'getCourierOrderAvailabilityV1' params
			</h2><pre>Array
(
    [0] => Array
        (
            [senderPlaceV1] => Array
                (
                    [countryCode] => PL
                    [zipCode] => 30732
                )

        )

)
</pre><h2>Request</h2><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:ns1=&quot;http://dpdservices.dpd.com.pl/&quot;&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;ns1:getCourierOrderAvailabilityV1&gt;
            &lt;senderPlaceV1&gt;
                &lt;countryCode&gt;PL&lt;/countryCode&gt;
                &lt;zipCode&gt;30732&lt;/zipCode&gt;
            &lt;/senderPlaceV1&gt;
            &lt;authDataV1&gt;
                &lt;login&gt;test&lt;/login&gt;
                &lt;masterFid&gt;256985&lt;/masterFid&gt;
                &lt;password&gt;KqvsoFLT2M&lt;/password&gt;
            &lt;/authDataV1&gt;
        &lt;/ns1:getCourierOrderAvailabilityV1&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
</pre><h2>Errors</h2><pre>Array
(
)
</pre><h2 style="padding: 10px 0 10px 0; display: block; border-top: solid 2px #000000; border-bottom: solid 2px #000000;">
			[2014-07-31 02:05:12]</h2><h2>Function 'generateProtocolV1' params
			</h2><pre>Array
(
    [0] => Array
        (
            [dpdServicesParamsV1] => Array
                (
                    [pickupAddress] => Array
                        (
                            [address] => 22 Płk. Dąbka Street
                            [city] => Kraków
                            [company] => DPD Poland
                            [countryCode] => PL
                            [email] => pub@prestashop.com
                            [fid] => 1495
                            [name] => DPD Poland
                            [phone] => +48 12 298-15-00
                            [postalCode] => 30732
                        )

                    [policy] => STOP_ON_FIRST_ERROR
                    [session] => Array
                        (
                            [sessionId] => 145331
                            [sessionType] => DOMESTIC
                        )

                    [documentId] => 72347
                )

            [outputDocFormatV1] => PDF
            [outputDocPageFormatV1] => LBL_PRINTER
        )

)
</pre><h2>Request</h2><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:ns1=&quot;http://dpdservices.dpd.com.pl/&quot;&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;ns1:generateProtocolV1&gt;
            &lt;dpdServicesParamsV1&gt;
                &lt;documentId&gt;72347&lt;/documentId&gt;
                &lt;pickupAddress&gt;
                  &lt;address&gt;22 Płk. Dąbka Street&lt;/address&gt;
                   &lt;city&gt;Krak&oacute;w&lt;/city&gt;
                    &lt;company&gt;DPD Poland&lt;/company&gt;
                    &lt;countryCode&gt;PL&lt;/countryCode&gt;
                    &lt;email&gt;pub@prestashop.com&lt;/email&gt;
                    &lt;fid&gt;1495&lt;/fid&gt;
                    &lt;name&gt;DPD Poland&lt;/name&gt;
                    &lt;phone&gt;+48 12 298-15-00&lt;/phone&gt;
                    &lt;postalCode&gt;30732&lt;/postalCode&gt;
                &lt;/pickupAddress&gt;
                &lt;policy&gt;STOP_ON_FIRST_ERROR&lt;/policy&gt;
                &lt;session&gt;
                    &lt;sessionId&gt;145331&lt;/sessionId&gt;
                    &lt;sessionType&gt;DOMESTIC&lt;/sessionType&gt;
                &lt;/session&gt;
            &lt;/dpdServicesParamsV1&gt;
            &lt;outputDocFormatV1&gt;PDF&lt;/outputDocFormatV1&gt;
            &lt;outputDocPageFormatV1&gt;LBL_PRINTER&lt;/outputDocPageFormatV1&gt;
            &lt;authDataV1&gt;
                &lt;login&gt;test&lt;/login&gt;
                &lt;masterFid&gt;256985&lt;/masterFid&gt;
                &lt;password&gt;KqvsoFLT2M&lt;/password&gt;
            &lt;/authDataV1&gt;
        &lt;/ns1:generateProtocolV1&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
</pre><h2>Errors</h2><pre>Array
(
)
</pre>